depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
    /* IN */
    case 0b010: {
      const uint32_t bitCount = arg & 0x1f;
      uint32_t sourceValue = inSourceValue(arg >> 5);

      if (bitCount == 0) {
        inputShiftReg = sourceValue;
        inputShiftCount = 32;
      } else {
        sourceValue &= lowMask(bitCount);
        if (shiftCtrl & SHIFTCTRL_IN_SHIFTDIR) {
          inputShiftReg >>= bitCount;
          inputShiftReg |= sourceValue << (32 - bitCount);
        } else {
          inputShiftReg <<= bitCount;
          inputShiftReg |= sourceValue;
        }
        inputShiftCount += bitCount;
        if (inputShiftCount > 32) {
          inputShiftCount = 32;
        }
      }

      if (shiftCtrl & SHIFTCTRL_AUTOPUSH && inputShiftCount >= pushThreshold()) {
        if (!rxFIFO.full()) {
          rxFIFO.push(inputShiftReg);
          updateDMARx();
          pio.checkInterrupts();
        } else {
          pio.rxStall |= FDEBUG_RXSTALL << this->index;
          pio.fdebug |= pio.rxStall;
          wait(WaitType::rxFIFO, false, inputShiftReg);
        }
        inputShiftCount = 0;
        inputShiftReg = 0;
      }

      break;
    }

    /* OUT */
    case 0b011: {
      if (shiftCtrl & SHIFTCTRL_AUTOPULL && outputShiftCount >= pullThreshold()) {
        outputShiftCount = 0;
        if (!txFIFO.empty()) {
          outputShiftReg = txFIFO.pull();
          updateDMATx();
          pio.checkInterrupts();
        } else {
          pio.txStall |= FDEBUG_TXSTALL << this->index;
          pio.fdebug |= pio.txStall;
          wait(WaitType::Out, false, arg);
        }
      }

      if (!waiting) {
        outInstruction(arg);
      }
      break;
    }

    /* PUSH/PULL */
    case 0b100: {
      const bool block = !!(arg & (1 << 5));
      const bool ifFullOrEmpty = !!(arg & (1 << 6));
      if (arg & 0x1f) {
        // Unknown instruction
        break;
      }
      if (arg & 0x80) {
        // PULL
        if (ifFullOrEmpty && shiftCtrl & SHIFTCTRL_AUTOPULL && outputShiftCount < pullThreshold()) {
          break;
        }
        if (!txFIFO.empty()) {
          outputShiftReg = txFIFO.pull();
          updateDMATx();
          pio.checkInterrupts();
        } else {
          pio.txStall |= FDEBUG_TXSTALL << this->index;
          pio.fdebug |= pio.txStall;
          if (block) {
            wait(WaitType::txFIFO, false, 0);
          } else {
            outputShiftReg = x;
          }
        }
        outputShiftCount = 0;
      } else {
        // PUSH
        if (ifFullOrEmpty && shiftCtrl & SHIFTCTRL_AUTOPUSH && inputShiftCount < pushThreshold()) {
          break;
        }
        if (!rxFIFO.full()) {
          rxFIFO.push(inputShiftReg);
          updateDMARx();
          pio.checkInterrupts();
        } else {
          pio.rxStall |= FDEBUG_RXSTALL << this->index;
          pio.fdebug |= pio.rxStall;
          if (block) {
            wait(WaitType::rxFIFO, false, inputShiftReg);
          }
        }
        inputShiftReg = 0;
        inputShiftCount = 0;
      }
      break;
    }

    /* MOV */
    case 0b101: {
      const uint32_t source = arg & 0x7;
      const uint32_t op = (arg >> 3) & 0x3;
      const uint32_t destination = (arg >> 5) & 0x7;
      const uint32_t value = inSourceValue(source);
      const uint32_t transformedValue = transformMovValue(value, op);
      setMovDestination(destination, transformedValue);
      break;
    }

    /* IRQ */
    case 0b110: {
      if (arg & 0x80) {
        // Unknown instruction
        break;
      }
      const bool clear = !!(arg & 0x40);
      const bool wait = !!(arg & 0x20);
      const uint32_t irq = irqIndex(arg & 0x1f, this->index);
      if (clear) {
        pio.irq &= ~(1u << irq);
        pio.irqUpdated();
      } else {
        pio.irq |= 1u << irq;
        pio.irqUpdated();
        if (wait) {
          this->wait(WaitType::IRQ, false, irq);
        }
      }
      break;
    }

    /* SET */
    case 0b111: {
      const uint32_t data = arg & 0x1f;
      const uint32_t destination = arg >> 5;
      switch (destination) {
        case 0b000:
          setSetPins(data);
          break;
        case 0b001:
          x = data;
          break;
        case 0b010:
          y = data;
          break;
        case 0b100:
          setSetPinDirs(data);
          break;
      }
      break;
    }
  }

  cycles++;

  const uint32_t sidesetCount = this->sidesetCount();
  const uint32_t execCtrl = this->execCtrl;
  // `opcode >> 8`: for an EXEC'd 32-bit value with bit 31 set JS gives a
  // negative number, but `& 0x1f` only keeps bits 8..12 either way.
  const uint32_t delaySideset = (opcode >> 8) & 0x1f;
  const bool sideEn = !!(execCtrl & EXECCTRL_SIDE_EN);
  // sidesetCount is 0..7: for 6 and 7 the JS shift count `5 - sidesetCount`
  // is negative and taken & 31 (so the mask is 0x7fffffff / 0x3fffffff).
  const int32_t delay =
      static_cast<int32_t>(delaySideset & lowMask(static_cast<uint32_t>(5 - static_cast<int32_t>(sidesetCount))));

  if (sidesetCount && (!sideEn || delaySideset & 0x10)) {
    const uint32_t sideset = static_cast<uint32_t>(
        jsSar(static_cast<int32_t>(delaySideset), static_cast<uint32_t>(5 - static_cast<int32_t>(sidesetCount))));
    setSideset(sideset, sideEn ? sidesetCount - 1 : sidesetCount);
  }

  if (execValid) {
    execValid = false;
    executeInstruction(execOpcode);
  } else if (waiting) {
    if (waitDelay < 0) {
      waitDelay = delay;
    }
    checkWait();
  } else {
    cycles += delay;
    delayLeft = delay;
  }
}

void StateMachine::wait(WaitType type, bool polarity, uint32_t index) {
  waiting = true;
  waitType = type;
  waitPolarity = polarity;
  waitIndex = index;
  waitDelay = -1;
  updatePC = false;
}

void StateMachine::nextPC() {
  if (pc == wrapTop()) {
    pc = wrapBottom();
  } else {
    pc = (pc + 1) & 0x1f;
  }
}

void StateMachine::step() {
  if (delayLeft > 0) {
    delayLeft--;
    return;
  }
  if (waiting) {
    checkWait();
    if (waiting) {
      return;
    }
  }

  updatePC = true;
  executeInstruction(pio.instructions[pc]);
  if (updatePC) {
    nextPC();
  }
}

void StateMachine::setSetPinDirs(uint32_t value) { pio.pinDirectionsChanged(value, setBase(), setCount()); }

void StateMachine::setSetPins(uint32_t value) { pio.pinValuesChanged(value, setBase(), setCount()); }

void StateMachine::setSideset(uint32_t value, uint32_t count) {
  if (execCtrl & EXECCTRL_SIDE_PINDIR) {
    pio.pinDirectionsChanged(value, sidesetBase(), count);
  } else {
    pio.pinValuesChanged(value, sidesetBase(), count);
  }
}

