depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
    case RXF0:
      return machines[0].readFIFO();
    case RXF1:
      return machines[1].readFIFO();
    case RXF2:
      return machines[2].readFIFO();
    case RXF3:
      return machines[3].readFIFO();
    case IRQ_:
      return irq;
    case IRQ_FORCE:
      return 0;
    case INPUT_SYNC_BYPASS:
      return inputSyncBypass;
    case DBG_PADOUT:
      return pinValues;
    case DBG_PADOE:
      return pinDirections;
    case DBG_CFGINFO:
      return 0x200404;
    case INTR:
      return intRaw();
    case IRQ0_INTE:
      return irq0IntEnable;
    case IRQ0_INTF:
      return irq0IntForce;
    case IRQ0_INTS:
      return irq0IntStatus();
    case IRQ1_INTE:
      return irq1IntEnable;
    case IRQ1_INTF:
      return irq1IntForce;
    case IRQ1_INTS:
      return irq1IntStatus();
  }
  return BasePeripheral::readUint32(offset);
}

void RPPIO::writeUint32(uint32_t offset, uint32_t value) {
  if (offset >= INSTR_MEM0 && offset <= INSTR_MEM31) {
    const uint32_t index = (offset - INSTR_MEM0) >> 2;
    instructions[index] = value & 0xffff;
    return;
  }
  if (offset >= SM0_CLKDIV && offset <= SM0_PINCTRL) {
    machines[0].writeUint32(offset - SM0_CLKDIV, value);
    return;
  }
  if (offset >= SM1_CLKDIV && offset <= SM1_PINCTRL) {
    machines[1].writeUint32(offset - SM1_CLKDIV, value);
    return;
  }
  if (offset >= SM2_CLKDIV && offset <= SM2_PINCTRL) {
    machines[2].writeUint32(offset - SM2_CLKDIV, value);
    return;
  }
  if (offset >= SM3_CLKDIV && offset <= SM3_PINCTRL) {
    machines[3].writeUint32(offset - SM3_CLKDIV, value);
    return;
  }
  switch (offset) {
    case CTRL: {
      for (uint32_t index = 0; index < 4; index++) {
        machines[index].enabled = value & (1u << index) ? true : false;
        if (value & (1u << (4 + index))) {
          machines[index].restart();
        }
        if (value & (1u << (8 + index))) {
          machines[index].clkDivRestart();
        }
      }
      const uint32_t shouldRun = value & 0xf;
      if (stopped && shouldRun) {
        stopped = false;
        run();
      }
      if (!shouldRun) {
        stopped = true;
      }
      break;
    }
    case FDEBUG:
      fdebug &= ~rawWriteValue;
      fdebug |= txStall | rxStall;
      break;
    case TXF0:
      machines[0].writeFIFO(value);
      break;
    case TXF1:
      machines[1].writeFIFO(value);
      break;
    case TXF2:
      machines[2].writeFIFO(value);
      break;
    case TXF3:
      machines[3].writeFIFO(value);
      break;
    case IRQ_:
      irq &= ~rawWriteValue;
      irqUpdated();
      break;
    case INPUT_SYNC_BYPASS:
      inputSyncBypass = value;
      break;
    case IRQ_FORCE:
      irq |= value;
      irqUpdated();
      break;
    case IRQ0_INTE:
      irq0IntEnable = value & 0xfff;
      checkInterrupts();
      break;
    case IRQ0_INTF:
      irq0IntForce = value & 0xfff;
      checkInterrupts();
      break;
    case IRQ1_INTE:
      irq1IntEnable = value & 0xfff;
      checkInterrupts();
      break;
    case IRQ1_INTF:
      irq1IntForce = value & 0xfff;
      checkInterrupts();
      break;
    default:
      BasePeripheral::writeUint32(offset, value);
  }
}

void RPPIO::pinValuesChanged(uint32_t value, uint32_t firstPin, uint32_t count) {
  // TODO: wrapping after pin 31
  const uint32_t mask = count > 31 ? 0xffffffff : lowMask(count) << firstPin;
  const uint32_t newValue = ((pinValues & ~mask) | ((value << firstPin) & mask)) & 0x3fffffff;
  pinValues = newValue;
}

void RPPIO::pinDirectionsChanged(uint32_t value, uint32_t firstPin, uint32_t count) {
  // TODO: wrapping after pin 31
  const uint32_t mask = count > 31 ? 0xffffffff : lowMask(count) << firstPin;
  const uint32_t newValue = ((pinDirections & ~mask) | ((value << firstPin) & mask)) & 0x3fffffff;
  pinDirections = newValue;
}

void RPPIO::checkInterrupts() {
  const uint32_t firstIrq = this->firstIrq;
  rp2040.setInterrupt(firstIrq, !!irq0IntStatus());
  rp2040.setInterrupt(firstIrq + 1, !!irq1IntStatus());
}

void RPPIO::irqUpdated() {
  for (StateMachine &machine : machines) {
    machine.checkWait();
  }
  checkInterrupts();
}

void RPPIO::checkChangedPins() {
  const uint32_t changedPins = (oldPinDirections ^ pinDirections) | (oldPinValues ^ pinValues);
  if (changedPins) {
    oldPinDirections = pinDirections;
    oldPinValues = pinValues;

    // Notify GPIO about the changed pins
    auto &gpio = rp2040.gpio;
    for (uint32_t gpioIndex = 0; gpioIndex < gpio.size(); gpioIndex++) {
      if (changedPins & (1u << gpioIndex)) {
        gpio[gpioIndex].checkForUpdates();
      }
    }
  }
}

void RPPIO::step() {
  for (StateMachine &machine : machines) {
    machine.clockTick();
  }
  checkChangedPins();
}

void RPPIO::stop() {
  for (StateMachine &machine : machines) {
    machine.enabled = false;
  }
  stopped = true;
  // (no runTimer to clear)
}

}  // namespace rp2040js
